%%%
%%%此函数是计算一个关节角的可操作性度的函数
%%%输入：angle一组关节角1*7
%%%输出：这组关节角的可操作度
%%%

function solution = CaozuoduOfAngles(angle)
%各转换矩阵
T01=GetTnm(angle,0,1);
T12=GetTnm(angle,1,2);
T23=GetTnm(angle,2,3);
T34=GetTnm(angle,3,4);
T45=GetTnm(angle,4,5);
T56=GetTnm(angle,5,6);
T67=GetTnm(angle,6,7);

%利用matlab计算变换矩阵
T01=T01;
T02=T01*T12;
T03=T01*T12*T23;
T04=T01*T12*T23*T34;
T05=T01*T12*T23*T34*T45;
T06=T01*T12*T23*T34*T45*T56;
T07=T01*T12*T23*T34*T45*T56*T67;

% simplify(T07)
T17=T12*T23*T34*T45*T56*T67;
T27=T23*T34*T45*T56*T67;
T37=T34*T45*T56*T67;
T47=T45*T56*T67;
T57=T56*T67;
T67=T67;

%%R0i=T0i([1 2 3],[1 2 3])  %获取R0i
R01=T01([1 2 3],[1 2 3]);
R02=T02([1 2 3],[1 2 3]);
R03=T03([1 2 3],[1 2 3]);
R04=T04([1 2 3],[1 2 3]);
R05=T05([1 2 3],[1 2 3]);
R06=T06([1 2 3],[1 2 3]);
R07=T07([1 2 3],[1 2 3]);

%%Zi=T0i([1 2 3],[3])  %获取Zi
Z1=T01([1 2 3],[3]);
Z2=T02([1 2 3],[3]);
Z3=T03([1 2 3],[3]);
Z4=T04([1 2 3],[3]);
Z5=T05([1 2 3],[3]);
Z6=T06([1 2 3],[3]);
Z7=T07([1 2 3],[3]);

%%Pi7=Ti7([1 2 3],[4])  %获取Pi7
P17=T17([1 2 3],[4]);
P27=T27([1 2 3],[4]);
P37=T37([1 2 3],[4]);
P47=T47([1 2 3],[4]);
P57=T57([1 2 3],[4]);
P67=T67([1 2 3],[4]);
P77=[0;0;0];

J=[cross(Z1,(R01*P17)),cross(Z2,(R02*P27)),cross(Z3,(R03*P37)),cross(Z4,(R04*P47)),cross(Z5,(R05*P57)),cross(Z6,(R06*P67)),cross(Z7,(R07*P77));Z1,Z2,Z3,Z4,Z5,Z6,Z7];

% W([1],[i])=J;
%雅可比矩阵奇异值分解
[U,S,V]=svd(J);
%求最小奇异值
%min=S([6],[6]);
%K=S(1:1,1)/S(6:6,6);%条件数
% L=S(6:6,6)/S(1:1,1);%处理后的条件数
w=S(1:1,1)*S(2:2,2)*S(3:3,3)*S(4:4,4)*S(5:5,5)*S(6:6,6);%可操作度


solution=w;